{
    "title": "title",
    "intro": "en",
    "intro2": "under construction",
    "skilleng": "software engineering",
    "skilldig": "digital circuits",
    "skillalg": "algorithm design",
    "skillfstack": "full-stack development",
    "skillacwri": "academic writing/proof reading/research",
    "skilltechwri": "technical & general topics writing",
    "skilltrans": "English-Portuguese translation/proof reading",
    "skilldatasc": "data science/analysis",
    "skillmathfin": "financial/statistical mathematics",
    "skilliot": "IoT design",
    "skillset": "skill set",
    "phil": "philosophy",
    "log": "logic",
    "ttg": "truth-table generator",
    "ttgs": "truth-table generators",
    "ukr": "free Ukraine",
    "ml": "machine learning",
    "under": "under construction",
    "wri": "writing",
    "acad": "academic",
    "words": "words",
    "rdtime": "reading time",
    "essay1": {
      "title": "a formação pessoal e profissional a partir da perspectiva da complexidade",
      "p1": "A filosofia da ciência pressupõe o determinismo e o racionalismo como norma. O determinismo postula que o universo é bem estruturado, ordenado e, portanto, previsível. Ele assume que existem regularidades, que os cientistas tendem a chamar de 'leis', que sempre se aplicam. A suposição de que existem leis universais às vezes é chamada de mecanicista [1].",
      "p2": "'Complexo' vem do latim cum plexus, 'com entrelaçamento' e indica algo composto por várias partes unidas. Os sistemas complicados são, por extensos que sejam, os que podem ser explicados pelas leis da física clássica, como as galáxias sem vida, ou os movimentos das marés, ou o deslocamento das dunas no deserto. Por outro lado, todos os organismos vivos são sistemas complexos e, mais ainda, agregados organizados desses organismos (por exemplo, um formigueiro). Os sistemas mais complexos são dados por relacionamentos entre agentes inteligentes, como um relacionamento de casal ou sistemas sociais, até a 'aldeia global' na qual vivemos hoje. As características principais dos sistemas complexos são a estrutura reticular (em forma de rede), distribuída, portanto não há elemento dominante mas uma interação contínua entre vários elementos, e o feedback, ou seja, a retro-ação para cada efeito, por sua vez, influencia a causa [2].",
      "p3": "A sociedade humana é um exemplo de sistema caótico, onde frequentemente causas e efeitos se confundem ou se retroalimentam. Não há como prever o resultado final das milhares de pequenas decisões tomadas por um agente ao longo do curso normal de um dia, muito menos os efeitos combinados das decisões de bilhões de indivíduos.",
      "p4": "Historicamente, temos inúmeros exemplos de civilizações que floresceram, tiveram sua 'era de ouro', apenas para eventualmente encontrarem o próprio colapso: o império romano, as civilizações mesoamericanas (incas, maias e astecas), os mongóis, persas, egípcios e tantos outros. Colapso, na definição de Tainter [4], 'é fundamentalmente uma perda, repentina e pronunciada, de um nível estabelecido de complexidade sócio-política'. Ele propõe onze mecanismos principais como causas do colapso:",
      "t1": "Exaurimento de recursos essenciais",
      "t2": "Estabelecimento de uma nova base de recursos",
      "t3": "Ocorrência de alguma catástrofe irreversível",
      "t4": "Resposta insuficiente às circunstâncias",
      "t5": "Outras sociedades complexas",
      "t6": "Invasores",
      "t7": "Conflito de classes, contradições sociais, mau gerenciamento das instituições ou mau comportamento",
      "t8": "Disfunção social",
      "t9": "Fatores místicos",
      "t10": "Combinação aleatória de eventos adversos",
      "t11": "Fatores econômicos",
      "p5": "Diante de um exame minucioso desta lista, acreditamos que existam interseções entre esses mecanismos, e que o ponto de irreversibilidade (point of no return) não raro se dá por uma combinação destes fatores.",
      "p6": "Ainda de acordo com Tainter, em todos os casos de colapso social por ele examinados, foram observados:",
      "t12:": "O custo da complexidade aumentava com o tempo enquanto os benefícios para a população caía",
      "t13": "Os custos cresceram substancialmente tardiamente, pouco antes do colapso, custos que foram impostos a uma população já enfraquecida pelo padrão antecedente de retornos marginais decrescentes",
      "p7": "A pergunta a que nos propomos a responder é de cunho ético, pois questiona o que deveríamos fazer como indivíduos, inseridos no contexto de uma sociedade complexa. Ao observar a si própria relativamente à enormidade coletiva do formigueiro, seria compreensível que uma formiga em particular decidisse que ela e suas contribuições por si sós são insignificantes, e decidisse entregar-se ao hedonismo ou cometer suicídio.",
      "p8": "E, de fato, há aqueles indivíduos, talvez não entre as formigas, mas certamente entre nós humanos, que escolhem esse caminho, sem entender as consequências deste pequeno ato. Essa postura, segundo Edgar Morin, o eminente filósofo e sociólogo francês, é decorrente de uma educação fragmentada, que apenas leva a um entendimento do universo com partes desconexas. E é esta incapacidade que leva Morin a propor a educação como um processo de compreensão do pensamento complexo que relaciona o local com o global, que permite a inclusão da uniformidade e diversidade incluídos dentro de um todo.",
      "p9": "A situação da civilização humana na atualidade é alarmante. A ciência sugere Antropoceno (antropos em grego: humano; a era dos humanos) como nome para nossa presente era geológica, que data do início do impacto humano na geologia e ecossistemas do planeta [5].",
      "p10": "Nossa espécie mereceu batizar uma era geológica. Esta é a magnitude do nosso impacto na Terra. Tendo como causa ancestral o advento da Revolução Industrial, quando começamos a queimar combustíveis fósseis, mudanças irreversíveis e em larga escala já estão ocorrendo;  a frequência, intensidade e os custos decorrentes de desastres naturais têm aumentado significativamente ano após ano (veja gráfico na página abaixo). Estaríamos à beira de um novo colapso, em um futuro não muito distante?",
      "p11": "Segundo o Secretário-Geral da ONU, Antonio Guterres, '[2021] é um ano crítico para a ação climática. Este relatório das Nações Unidas e organizações parceiras científicas globais fornece uma avaliação holística da ciência climática mais recente. O resultado é uma avaliação alarmante de quão longe estamos do curso. Ainda estamos significativamente fora do cronograma para cumprir as metas do Acordo de Paris. Este ano, as emissões de combustíveis fósseis se recuperaram, as concentrações de gases de efeito estufa continuaram a aumentar e eventos climáticos graves causados pelo homem afetaram a saúde, a vida e os meios de subsistência em todos os continentes. A menos que haja reduções imediatas, rápidas e em grande escala nas emissões de gases de efeito estufa, limitar o aquecimento a 1,5°C será impossível, com consequências catastróficas para as pessoas e o planeta do qual dependemos', disse ele no prefácio [6, 7].",
      "p12": "Diante deste cenário apocalíptico, a conclui-se que resposta à questão proposta é: É imperativo, não apenas de um ponto de vista ético como da própria autopreservação, senão da espécie, tomar medidas em caráter urgente que sensibilizem a sociedade, sacuda-a de sua apatia, no sentido de que cada pequena ação conta. Na nossa própria experiência, uma simples mudança de perfil de condução veicular pode trazer economias na casa dos 20%. No entanto, este impacto só seria significativo se adotado por uma parcela representativa da população. E isso suscita a questão: Como convencer os céticos, os negacionistas, os ingênuos e  os indiferentes? ",
      "p13": "A única saída é a educação. Segundo Morin, citado por Gian Danton, '... o que temos vivido até agora é a interdisciplinaridade, em que as disciplinas estão juntas, mas cada uma olha para o seu próprio umbigo. Em seu lugar, ele propõe a polidisciplinaridade e a transdisciplinaridade. Na polidisciplinaridade as disciplinas ainda existem isoladamente, mas os alunos as usam em conjunto para resolver problemas. Uma escola que leve seus alunos para analisar seu bairro do  ponto de vista da geografia, história, língua portuguesa (as expressões mais utilizadas por seus moradores, por exemplo) está praticando a polidisciplinaridade. Se, ao invés de fazer trabalhos isolados para o professor de geografia, história e língua portuguesa, o aluno fizer um trabalho só, que envolva os três tipos de conhecimentos, estará praticando a transdisciplinaridade' [8].",
      "p14": "Mas tal mudança de paradigma leva tempo para ser implementada. As instituições não são conhecidas por sua plasticidade. Segundo o antropólogo brasileiro Darcy Ribeiro, 'Se os governantes não construírem escolas, em 20 anos faltará dinheiro para construir presídios', disse ele em uma conferência em 1982 [9].",
      "p15": "Resta, inescapavelmente, para aqueles de nós que não somos céticos, negacionistas, ingênuos ou indiferentes, a ação. Adotar práticas sustentáveis, mesmo em pequena escala, e tentar disseminá-las entre nosso círculo familiar, social, profissional. Às corporações, o imperativo é ainda mais forte, sobre seus ombros recai grande parte da responsabilidade de adotar processos e materiais que reduzam seu impacto sobre o meio ambiente. Ao cidadão, cobrar de seus representantes eleitos ações no mesmo sentido. 'Fazer barulho', aumentar a conscientização coletiva, multiplicar a ideia. Parafraseando Lorenz, convencer mais 'borboletas' a 'baterem suas asas', é a única maneira de gerar o 'tornado' do qual necessitamos para impedir o pior."
    }
}