{
    "title": "title",
    "intro": "en",
    "intro2": "under construction",
    "skilleng": "software engineering",
    "skilldig": "digital circuits",
    "skillalg": "algorithm design",
    "skillfstack": "full-stack development",
    "skillacwri": "academic writing/proof reading/research",
    "skilltechwri": "technical & general topics writing",
    "skilltrans": "English-Portuguese translation/proof reading",
    "skilldatasc": "data science/analysis",
    "skillmathfin": "financial/statistical mathematics",
    "skilliot": "IoT design",
    "skillset": "skill set",
    "phil": "philosophy",
    "log": "logic",
    "ttg": "truth-table generator",
    "ttgs": "truth-table generators",
    "ukr": "free Ukraine",
    "ml": "machine learning",
    "under": "under construction",
    "wri": "writing",
    "acad": "academic",
    "words": "words",
    "rdtime": "reading time",
    "essay1": {
        "title": "On the Personal and Professional Formation Under the Light of Complexity",
        "stit": "An Essay",
        "p1": "The philosophy of science assumes determinism and rationalism as a norm. Determinism implies that the universe is well-structured, ordered, and therefore, predictable. That there are regularities, which the scientist call 'laws', that always apply. The supposition of the existence of such laws is sometimes called mechanicism [1].",
        "p2": "'Complex' derives from the Latin cum plexus, 'interlinked', and indicates something composed of parts. Complicated systems, extense as they may be, are those amenable to explanation by classic physics, such as lifeless galaxies, tidal phenomena or the motion of desert dunes. Living organisms, conversely, are complex and even more so their aggregates, e.g., an anthill. The most complex systems are those governed by the relationships among intelligent agents, as in a male-female relationship, social systems, up to the 'global village' in which we live. The main characteristics of CSs (complex systems) are the reticular (network-like), disitributed structure, therefore decentralised, without a dominant element, but rather a continual interaction among several elements and the feedback, where each effect affects its own cause [2].",
        "p3": "Human society is an example of a chaotic system, where often cause and effect get mixed up and feedback on each other. There is no telling the final result of thousands of small decisions made by an agent in the course of any given day, let alone the combined effects of billions of individuals' decisions.",
        "p4": "There are countless examples throughout History of civilisations that blossomed, had their Golden Age as it were, only to eventually meet their own colapse: the Roman empire, the mesoamerican civilisations (Incas, Mayas and Aztecs), the Mongolian, Persian, Egyptian and many others. Collapse, in Tainter's view [4], 'is fundamentally a loss, sudden and pronounced, of an established level of socio-political complexity'. He proposes eleven principal mechanismsas causes of collapse:",
        "p5": "A careful analysis of the above list, we believe, suggests the existence of some overlap among the proposed mechanisms, and that the point of no return is often reached through a combination of said factors.",
        "p6": "Ainda de acordo com Tainter, em todos os casos de colapso social por ele examinados, foram observados:",
        "p7": "The question we propose to answer is of an ethical nature, as it asks in which manner should one conduct oneself as an individual in the context of a complex society. While observing itself relatively to the collective enormity of its anthill, an ant in particular could be forgiven if it decided that it and its contribution alone were insignificant and decided to commit suicide or to abandon itself to hedonsim.",
        "p8": "And there are, in fact, individuals, perhaps no amongst the ants, but certainly amogst us humans, who choose that path, withouth comprehending the consequences of this small act. Such attitude, according to the eminent French philosopher and sociologist Edgar Morin, stems from a fragmented education, which can only lead to an understanding of the universe composed of disconnected parts. And it is this very inability that moves Morin to propose education as a process of understanding of the complex thought, relating the local with the global, allowing the inclusion of uniformity and diversity as part of a whole.",
        "p9": "The current situation of human civilization is nothing short of alarming. Scienctists have suggested Antropocene (antropos in Greek: human; the age of humans) as a name for our present geological age, whose beggining dates from the start of the impact of human activities on our planet's geology and ecosytems [5].",
        "p10": "Our species has the distinction of christening a geologic era. Such is the magnitude of our impact on Earth. Large scale, and perhaps irreversible changes in the weather patterns are already taking place, owing, ultimately, to the advent of the Industrial Revolution, when we first started burning fossil fuels;  the frequency, intensity and costs of natural disasters have been increasing year after year (see graphic below). Could we be on the verge of a new collapse, in a not too distant future?",
        "p11": "'[2021] This is a critical year for climate action. This report by the United Nations and global scientific partner organizations provides a holistic assessment of the most recent climate science.  The result is an alarming appraisal of just how far off course we are,' said UN Secretary-General Antonio Guterres. 'We are still significantly off-schedule to meet the goals of the Paris Agreement.  This year has seen fossil fuel emissions bounce back, greenhouse gas concentrations continuing to rise and severe human-enhanced weather events that have affected health, lives and livelihoods on every continent.  Unless there are immediate, rapid and large-scale reductions in greenhouse gas emissions, limiting warming to 1.5°C will be impossible, with catastrophic consequences for people and the planet on which we depend,' he said in the foreword [6, 7].",
        "p12": "Diante deste cenário apocalíptico, a conclui-se que resposta à questão proposta é: É imperativo, não apenas de um ponto de vista ético como da própria autopreservação, senão da espécie, tomar medidas em caráter urgente que sensibilizem a sociedade, sacuda-a de sua apatia, no sentido de que cada pequena ação conta. Na nossa própria experiência, uma simples mudança de perfil de condução veicular pode trazer economias na casa dos 20%. No entanto, este impacto só seria significativo se adotado por uma parcela representativa da população. E isso suscita a questão: Como convencer os céticos, os negacionistas, os ingênuos e  os indiferentes? ",
        "p13": "A única saída é a educação. Segundo Morin, citado por Gian Danton, '... o que temos vivido até agora é a interdisciplinaridade, em que as disciplinas estão juntas, mas cada uma olha para o seu próprio umbigo. Em seu lugar, ele propõe a polidisciplinaridade e a transdisciplinaridade. Na polidisciplinaridade as disciplinas ainda existem isolada    mente, mas os alunos as usam em conjunto para resolver problemas. Uma escola que leve seus alunos para analisar seu bairro do  ponto de vista da geografia, história, língua portuguesa (as expressões mais utilizadas por seus moradores, por exemplo) está praticando a polidisciplinaridade. Se, ao invés de fazer trabalhos isolados para o professor de geografia, história e língua portuguesa, o aluno fizer um trabalho só, que envolva os três tipos de conhecimentos, estará praticando a transdisciplinaridade' [8].",
        "p14": "Mas tal mudança de paradigma leva tempo para ser implementada. As instituições não são conhecidas por sua plasticidade. Segundo o antropólogo brasileiro Darcy Ribeiro, 'Se os governantes não construírem escolas, em 20 anos faltará dinheiro para construir presídios', disse ele em uma conferência em 1982 [9].",
        "p15": "Resta, inescapavelmente, para aqueles de nós que não somos céticos, negacionistas, ingênuos ou indiferentes, a ação. Adotar práticas sustentáveis, mesmo em pequena escala, e tentar disseminá-las entre nosso círculo familiar, social, profissional. Às corporações, o imperativo é ainda mais forte, sobre seus ombros recai grande parte da responsabilidade de adotar processos e materiais que reduzam seu impacto sobre o meio ambiente. Ao cidadão, cobrar de seus representantes eleitos ações no mesmo sentido. 'Fazer barulho', aumentar a conscientização coletiva, multiplicar a ideia. Parafraseando Lorenz, convencer mais 'borboletas' a 'baterem suas asas', é a única maneira de gerar o 'tornado' do qual necessitamos para impedir o pior.",
        "t1": "Exaurimento de recursos essenciais",
        "t2": "Estabelecimento de uma nova base de recursos",
        "t3": "Ocorrência de alguma catástrofe irreversível",
        "t4": "Resposta insuficiente às circunstâncias",
        "t5": "Outras sociedades complexas",
        "t6": "Invasores",
        "t7": "Conflito de classes, contradições sociais, mau gerenciamento das instituições ou mau comportamento",
        "t8": "Disfunção social",
        "t9": "Fatores místicos",
        "t10": "Combinação aleatória de eventos adversos",
        "t11": "Fatores econômicos",
        "t12": "O custo da complexidade aumentava com o tempo enquanto os benefícios para a população caía",
        "t13": "Os custos cresceram substancialmente tardiamente, pouco antes do colapso, custos que foram impostos a uma população já enfraquecida pelo padrão antecedente de retornos marginais decrescentes"
        
    },
    "essay2": {
    "title": "Fritjoff Capra: A Brief Critique",
    "p1": "Na visão deste autor, inobstante qualquer juízo de valor que se faça às prescrições de Capra, sua tentativa de conciliar misticismo oriental e ciência é equivocada, na melhor das hipóteses. Segundo ele mesmo, 'A Ciência não necessita do Misticismo, assim como o Misticismo não necessita da Ciência; mas o Homem necessita ambos' (Capra, 1975). Quaisquer que sejam as necessidades espirituais do indivíduo, ele não busca saciá-las nas ciência mais do que busca no misticismo respostas para questões científicas.",
    "p2": "Acreditamos que a abordagem holística, transdisciplinar proposta por Morin  refere-se a uma re-união entre as ciências, não entre ciência e não-ciência. No sentido da transdisciplinariedade, Morin estava certo e já vemos a medicina contemporânea adotando um enfoque holístico; atualmente é corriqueiro receber conselhos nutricionais e de mudança de estilo de vida oriundos do seu cardiologista. Nisto consiste praticar a medicina de um modo holístico, ao não olhar apenas para o órgão isolado, mas como parte do indivíduo.",
    "p3": "Outrossim, 'desde o clássico ataque de Gilbert Ryle (1949)' (Dennet, 1993) ao dualismo cartesiano, a comunidade científica, formal e amplamente, passou a repudiá-lo, face às (então) recentes descobertas científicas, principalmente na área da neurociência. Ou seja, a comunidade científica reconheceu no dualismo o mesmo problema proposto por Capra e vem, desde então, tentando desprender-se dessa noção. Trata-se de um paradigma com raízes profundas, mas essencialmente a visão de Capra revelou-se profética, e o problema remanescente é que talvez a mudança não aconteça no passo necessário."
    },
    "essay3": {
    "title": "refutação de conceitos ministrados como parte do conteúdo da matéria",
    "p1": "Comecemos endereçando alguns problemas. O primeiro está na teoria do Prof. Pedro Calabrez sobre o relacionamento entre pensamento e linguagem. Enquanto não resta dúvida de que ambos estão intimamente ligados, é errôneo afirmar que pensamos em português ou que pessoas bilíngues pensam em outro idioma ao empregá-lo.",
    "p2": "Se assim fosse, não teríamos dificuldades de nos expressar no nosso idioma nativo. No entanto, quantas vezes 'nos expressamos mal' ou escolhemos a palavra errada, ainda que o conceito mental esteja claro em nossas mentes? Isso sugere a existência de algum tipo de processamento que ocorre para transformar o pensamento em palavras, em qualquer que seja o idioma.",
    "p3": "George Orwell (Orwell, 1949), no apêndice de seu famoso livro 1984, imagina um futuro em que, no ano 2050, se instalaria uma sociedade utopicamente igualitária, tornada possível pelo dispositivo definitivo de controle de pensamento: a linguagem Newspeak. Numa reductio ad absurdum, nesta linguagem seria impossível conceber pensamentos imorais ou ilegais, simplesmente porque não havia meios de expressá-los em Newspeak. Não havendo uma palavra para violência, a violência deixaria de existir. Isso é análogo a postular a existência de lobisomens, pois 'se existe o nome, existe o bicho'.",
    "p4": "O eminente neuropsicólogo Steven Pinker argúi que o cérebro pensa em uma linguagem simbólica, multimodal (Pinker, 1994), o que vai ao encontro das teorias de Chomsy sobre a Gramática Universal (Chomsky, 1972). Aprimorar a linguagem pode ajudar a aprimorar o pensamento como sugere Calabrez, mas principalmente porque a linguagem tem o poder de transmitir uma nova ideia ou pensamento da mente de um indviduo para outro; a linguagem é um meio, uma mídia.",
    "p5": "Um novo conceito pode ser apreendido de uma maneira que não utilize a linguagem em absoluto, como diversas espécies animais, que aprendem comportamentos apropriados para cada situação simplesmente observando e imitando o comportamento dos adultos.",
    "p6": "O segundo problema jaz na asserção do Prof Pilz de que 'estamos [a raça humana] num ponto de estagnação' [1] do ponto de vista evolucionário. Esta é uma informação equivocada, cuja origem pode ser traçada à famosa entrevista de 2000 de Stephen J. Gould, respeitado paleontologista e biólogo evolucionário,  onde ele afirma que '(...) Não houve nenhuma mudança biológica em humanos em 40.000 ou 50.000 anos.'",
    "p7": "Há, no entanto, evidências em contrário. A população que habita o plateau tibetano apresenta uma mutação que lhes permite uma absorção mais eficiente do oxigênio rarefeito àquelas altitudes. Ora, a região onde hoje está o Tibet tem sido ocupada há cerca de 21.000 anos, tendo sida amplamente repopulada há cerca de 3.000 anos por imigrantes neolíticos [2, 3].",
    "p8": "Outras mutações recentes, propostas por Ilardo et al [4] e Gislén et al [5], sugerem que os Sama-Bajau, um grupo étnico do sudeste asiático, desenvolveram um baço maior e melhor visão sub-aquática  relativamente a etnias próximas, adaptações que favorecem seu estilo de vida pescador-coletor. Ver [6] para um artigo na revista Nature sobre mutações nos últimos 5.000 anos."
    },
    "essay4": {
    "title": "Da Experiência Estética",
    "p1": "No presente ensaio, buscamos, através de uma breve análise, dissecar o conceito e a importância da estética a partir de um ponto de vista que busca informar-se tanto na filosofia quanto na biologia.",
    "p2": "A estética costuma ser definida como um ramo da filosofia que trata da natureza da beleza e do gosto, examinando valores frequentemente expressos como julgamentos de valor instrinsecamente subjetivos.",
    "p3": "Tal estudo pode, a priori, padecer da aparência de pouca importância relativamente a outras arenas do estudo e do conhecimento humanos; pretendemos afastar essa noção, ao demonstrar que a estética é um aspecto fundamental da existência humana, e mais, que não se trata uma faculdade exclusivamente humana.",
    "p4": "Em seu nível mais basilar, postulamos que o senso estético emerge a partir de um processo fisiológico comum a todos os seres vivos, qual seja, a homeostase.",
    "p5": "Em biologia, a homeostase é o estado de condições internas, físicas e químicas constantes mantidas pelos sistemas vivos. Esta é a condição de funcionamento ideal do organismo e inclui muitas variáveis, como temperatura do organismo e equilíbrio hídrico, sendo mantidas dentro de certos limites (intervalo homeostático). Outras variáveis incluem, em mamíferos, o pH do líquido extracelular, as concentrações de íons de sódio, potássio e cálcio, bem como o nível glicêmico, que precisam ser regulados apesar das mudanças no ambiente, dieta ou nível de atividade. Cada uma dessas variáveis é controlada por um ou mais mecanismos homeostáticos, que juntos mantêm a vida.",
    "p6": "Mesmo seres unicelulares equipados como única modalidade sensorial a capacidade de perceber gradientes de concentração de diferentes substâncias ao seu redor são capazes de 'preferências', como a preferência inata por nutrientes ao invés de substâncias nocivas. Sugerimos que essa é a origem ancestral do senso estético.",
    "p7": "Ao longo da evolução, esse fenômeno se tornou cada vez mais complexo, manifestando-se de diversas maneiras para diferentes espécies, mas sempre com um tema subjacente comum: um indicador de uma qualidade desejável, à revelia da compreensão do sujeito acerca da teleologia da preferência.",
    "p8": "Como exemplo, diversas espécies de aves desenvolveram dimorfismo sexual, que consiste em diferenças fenotípicas significativas entre o macho e a fêmea da espécie; sendo o macho em geral maior e mais colorido do que a fêmea, nas quais prepondera uma plumagem inconspícua. O pavão é um caso notável desse fenômeno. Sua plumagem exuberante evoluiu como mecanismo de seleção sexual por parte das fêmeas, ao mesmo tempo que constitui sério embaraço para seu dono em se tratando de evadir predadores.",
    "p9": "De modo análogo, nós humanos damos preferência a certas características anatômicas indicativas de um parceiro(a) desejável, tendemos a favorecer uma paisagem ensolarada e primaveril (que evoca fertilidade) à uma desértica (desolada e desprovida de recursos); mas com uma camada de extra de 'bagagem' cultural adquirida. ",
    "p10": "E aqui adentramos o terreno da filosofia. Kierkegaard apresenta seu opus em uma progressão dialética de três estados existenciais; o primeiro é estético, que dá lugar ao ético, que por sua vez leva à religião. Hume propõe que as emoções são o fundamento do julgamento moral. Em Kant, a conexão entre julgamento estético e sentimento moral é um tema recorrente. Para Schopenhauer, sendo a experiência estética a única maneira de obter verdadeira compreensão do mundo e da existência, esta é pré-condição necessária para o exercício da escolha ética. Mais recentemente, entre os pragmatistas, quando Peirce definiu a ética como ciência normativa precedente à lógica, definiu também a estética como ciência normativa diretamente precedente à ética.",
    "p11": "Semelhante à noção de prazer desinteressado em Kant, na estética de Schopenhauer, o lado subjetivo da experiência estética envolve o prazer sem elemento volitivo da tranquilidade. A experiência da tranquilidade estética contrasta fortemente com a von-tade comum. Todo querer, segundo Schopenhauer, envolve sofrimento, na medida em que se origina da necessidade e da deficiência. A satisfação, quando alcançada, proporciona uma alegria fugaz e cede rapidamente a um doloroso tédio, que equivale a uma deficiência, e que recomeça todo o processo.",
    "p12": "Conclusão esta que nos parece fortemente reminiscente dos preceitos budistas, em particular da Segunda Nobre Verdade, conhecida como Samudaya, que significa surgimento e refere-se à origem de todo o sofrimento humano, que é o desejo ou Tanha.",
    "p13": "Para que possamos apreciar a beleza simples das coisas corriqueiras, é necessária uma mudança repentina de perspectiva, ainda que breve.",
    "p14": "Um exercício de auto-negação de pequenos prazeres ocasionalmente pode realçar a experiência de desfrutá-los com mais atenção, assim como praticar – aos poucos, inicialmente – o desprendimento em relação a bens materiais. Uma técnica potencialmente útil, proveniente da psicologia cognitivo-comportamental, é conhecida como Mindfulness - ou Atenção Plena. É um estado onde pratica-se qualidades de atenção ao momento presente e autocompaixão com experiências desafiadoras. Através do treinamento de mindfulness pode-se aprender a perceber pensamentos, sensações corporais e emoções no momento que ocorrem, sem reagir de maneira automática ou habitual, e, com isso, fazer escolhas mais conscientes e funcionais, influenciando positivamente na maneira como lidamos com os desafios cotidianos."
    },
    "tech1": {
        "title": "Configuring Linux Server 20.04 LTS as a Web Server to Host a React Application",
        "p1": "This how-to assumes a bare-bones 20.04 LTS Ubuntu Server freshly installed and ready to be configured, and with SSH access, as well as a production version of your React application, which by default sits in the build folder within your solution.",
        "p2": "From the command line, open the ssh session with",
        "cmd1": "\\ssh -l <username> <IP number>",
        "p3": ", altering username and ip address apropriately.",
        "p4": "I'm a Windows guy, so I dislike having to sudo everything and typing and retyping my password, so I accept the associated risks and enable the root account with",
        "cmd2": "# sudo passwd root",
        "p5": ", at least for the initial configuration; it may be disabled later. If you choose to do the same, be sure to pick a strong password.",
        "p6": "After setting the new password, switch to the root account with ",
        "cmd3": "# su –",
        "p7": "Good practice recommends the creation of a new user account with limited privileges for daily use, regular usage of root account being strongly discouraged. The new account can be granted temporary super user rights on an as-needed basis.",
        "p8": "Next step, securing the server. Our chosen distro should come with ufw (Uncomplicated Firewall) pre-installed but inactive. We'll check it with",
        "cmd4": "# ufw status",
        "p9": "The firewall must be first configured to allow ssh connections, lest we lock ourselves out when enabling it.",
        "p10": "Now that our basic firewall is up and running, we'll install the light-weight web server, Nginx. But first, since this is the first time we're running the beast, we'd better update the local package index with",
        "p11": "e então",
        "p12": "We can't forget to punch a hole in the firewall for the server. Check the ufw again with",
        "p13": "The first option tantamounts to the following two combined, i.e, ports tcp 80 and 443 will be opened. Choose whatever suits your needs. I'll go ahead and open both:",
        "p14": "We can then check it",
        "p15": "While we're at it, let's check nginx too:"
    },
    "techa": "technical",
    "by": "by",
    "expresp": "expected response",
    "drw": "erotic art",
    "autom": {
      "title": "Auto Associative Memory",
      "p1": "Auto-associative memories are content based memories which can recall a stored sequence when they are presented with a partial or noisy version of it. They are very effective in de-noising or removing interference from the input."
    },
    "genint": "general interest",
    "mike": {
        "title": "The Curious Story of Mike, the Headless Chicken"
      }
}